Revit 2026 API

# MaterialAspect Enumeration

---

A list of all material aspects that a material can store PropertySetElements for.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MaterialAspect
```
```vb
Public Enumeration MaterialAspect
```
```cpp
public enum class MaterialAspect
```
```fsharp
type MaterialAspect
```

| Member name | Value | Description |
| --- | --- | --- |
| Structural | 0 | Structural |
| Thermal | 1 | Thermal |

#### Reference

Autodesk.Revit.DB Namespace